In [1]:
# import here ,the data readersfrom pandas library 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline 
from sklearn.model_selection import train_test_split
import seaborn as sb
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import scale 
from collections import Counter 
from sklearn import linear_model
import math  # to perform  mathematical calculations

In [2]:
#read  file /retrieving the dataset
data = pd.read_excel('empSalary.xlsx')   # Coma Separated Raw Data 
data.head(5)    # Partial view of the total data

,Emp_ID,Emp_Age,Expereince,Sex,Education_in_Year,Annual_Rate,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,2038,25,3,Male,2,47278.4,NaN,NaN,2,NaN,NaN,NaN,NaN
1,8703,32,3,Male,4,47902.4,NaN,NaN,1,NaN,NaN,NaN,NaN
2,8443,27,3,Male,4,47902.4,NaN,NaN,1,NaN,NaN,NaN,NaN
3,5114,29,3,Female,4,47902.4,NaN,NaN,1,NaN,NaN,NaN,NaN
4,1120,31,5,Male,2,40902.4,NaN,NaN,1,NaN,NaN,NaN,NaN

In [3]:
def tra_sex(x):
    if x== 'Male':
        return 1
    if x== 'Female':
        return 2

In [4]:
data['tra_sex']=data['Sex'].apply(tra_sex)
data.head(6)

,Emp_ID,Emp_Age,Expereince,Sex,Education_in_Year,Annual_Rate,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,tra_sex
0,2038,25,3,Male,2,47278.4,NaN,NaN,2,NaN,NaN,NaN,NaN,1
1,8703,32,3,Male,4,47902.4,NaN,NaN,1,NaN,NaN,NaN,NaN,1
2,8443,27,3,Male,4,47902.4,NaN,NaN,1,NaN,NaN,NaN,NaN,1
3,5114,29,3,Female,4,47902.4,NaN,NaN,1,NaN,NaN,NaN,NaN,2
4,1120,31,5,Male,2,40902.4,NaN,NaN,1,NaN,NaN,NaN,NaN,1
5,153,33,5,Female,2,44902.4,NaN,NaN,2,NaN,NaN,NaN,NaN,2

In [5]:
newData =list(data.columns)
newData

['Emp_ID ',
 'Emp_Age ',
 'Expereince ',
 'Sex',
 'Education_in_Year ',
 'Annual_Rate',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'tra_sex']

In [6]:
newData[4],newData[5],newData[6]=newData[6],newData[4],newData[5]
newData                                                               # reordering the column

['Emp_ID ',
 'Emp_Age ',
 'Expereince ',
 'Sex',
 'Unnamed: 6',
 'Education_in_Year ',
 'Annual_Rate',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'tra_sex']

In [7]:
data=data[newData]

In [8]:
data.head(5)

XX=data.iloc[:, 3].value_counts()
XX

Female    270
Male      230
Name: Sex, dtype: int64

In [25]:
270/(270+230)  #

0.54

In [9]:
X= data[['tra_sex']]
y= data['Annual_Rate']

In [10]:
y.shape

(500,)

In [12]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1)

In [13]:
X_train.shape

(400, 1)

In [14]:
y_train.shape

(400,)

In [15]:
reg=LinearRegression()
reg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [16]:
reg.coef_

array([-1150.77616747])

In [23]:
reg.score(X,y)

0.0042388168987873565

In [24]:
reg.predict([[2]])      # When Female feature is introduced the salary of a new employee is shown below

array([51602.00296296])